betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_spi.c
/** @addtogroup SPI_DDL_EF_Init
  * @{
  */

/**
  * @brief  De-initialize the SPI registers to their default reset values.
  * @param  SPIx SPI Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: SPI registers are de-initialized
  *          - ERROR: SPI registers are not de-initialized
  */
ErrorStatus DDL_SPI_DeInit(SPI_TypeDef *SPIx)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_SPI_ALL_INSTANCE(SPIx));

#if defined(SPI1)
  if (SPIx == SPI1)
  {
    /* Force reset of SPI clock */
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_SPI1);

    /* Release reset of SPI clock */
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_SPI1);

    status = SUCCESS;
  }
#endif /* SPI1 */
#if defined(SPI2)
  if (SPIx == SPI2)
  {
    /* Force reset of SPI clock */
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_SPI2);

    /* Release reset of SPI clock */
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_SPI2);

    status = SUCCESS;
  }
#endif /* SPI2 */
#if defined(SPI3)
  if (SPIx == SPI3)
  {
    /* Force reset of SPI clock */
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_SPI3);

    /* Release reset of SPI clock */
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_SPI3);

    status = SUCCESS;
  }
#endif /* SPI3 */
#if defined(SPI4)
  if (SPIx == SPI4)
  {
    /* Force reset of SPI clock */
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_SPI4);

    /* Release reset of SPI clock */
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_SPI4);

    status = SUCCESS;
  }
#endif /* SPI4 */
#if defined(SPI5)
  if (SPIx == SPI5)
  {
    /* Force reset of SPI clock */
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_SPI5);

    /* Release reset of SPI clock */
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_SPI5);

    status = SUCCESS;
  }
#endif /* SPI5 */
#if defined(SPI6)
  if (SPIx == SPI6)
  {
    /* Force reset of SPI clock */
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_SPI6);

    /* Release reset of SPI clock */
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_SPI6);

    status = SUCCESS;
  }
#endif /* SPI6 */

  return status;
}

/**
  * @brief  Initialize the SPI registers according to the specified parameters in SPI_InitStruct.
  * @note   As some bits in SPI configuration registers can only be written when the SPI is disabled (SPI_CTRL1_SPIEN bit =0),
  *         SPI peripheral should be in disabled state prior calling this function. Otherwise, ERROR result will be returned.
  * @param  SPIx SPI Instance
  * @param  SPI_InitStruct pointer to a @ref DDL_SPI_InitTypeDef structure
  * @retval An ErrorStatus enumeration value. (Return always SUCCESS)
  */
ErrorStatus DDL_SPI_Init(SPI_TypeDef *SPIx, DDL_SPI_InitTypeDef *SPI_InitStruct)
{
  ErrorStatus status = ERROR;

  /* Check the SPI Instance SPIx*/
  ASSERT_PARAM(IS_SPI_ALL_INSTANCE(SPIx));

  /* Check the SPI parameters from SPI_InitStruct*/
  ASSERT_PARAM(IS_DDL_SPI_TRANSFER_DIRECTION(SPI_InitStruct->TransferDirection));
  ASSERT_PARAM(IS_DDL_SPI_MODE(SPI_InitStruct->Mode));
  ASSERT_PARAM(IS_DDL_SPI_DATAWIDTH(SPI_InitStruct->DataWidth));
  ASSERT_PARAM(IS_DDL_SPI_POLARITY(SPI_InitStruct->ClockPolarity));
  ASSERT_PARAM(IS_DDL_SPI_PHASE(SPI_InitStruct->ClockPhase));
  ASSERT_PARAM(IS_DDL_SPI_NSS(SPI_InitStruct->NSS));
  ASSERT_PARAM(IS_DDL_SPI_BAUDRATE(SPI_InitStruct->BaudRate));
  ASSERT_PARAM(IS_DDL_SPI_BITORDER(SPI_InitStruct->BitOrder));
  ASSERT_PARAM(IS_DDL_SPI_CRCCALCULATION(SPI_InitStruct->CRCCalculation));

  if (DDL_SPI_IsEnabled(SPIx) == 0x00000000U)
  {
    /*---------------------------- SPIx CTRL1 Configuration ------------------------
     * Configure SPIx CTRL1 with parameters:
     * - TransferDirection:  SPI_CTRL1_BMEN, SPI_CTRL1_BMOEN and SPI_CTRL1_RXOMEN bits
     * - Master/Slave Mode:  SPI_CTRL1_MSMCFG bit
     * - DataWidth:          SPI_CTRL1_DFLSEL bit
     * - ClockPolarity:      SPI_CTRL1_CPOL bit
     * - ClockPhase:         SPI_CTRL1_CPHA bit
     * - NSS management:     SPI_CTRL1_SSEN bit
     * - BaudRate prescaler: SPI_CTRL1_BRSEL[2:0] bits
     * - BitOrder:           SPI_CTRL1_LSBSEL bit
     * - CRCCalculation:     SPI_CTRL1_CRCEN bit
     */
    MODIFY_REG(SPIx->CTRL1,
               SPI_CTRL1_CLEAR_MASK,
               SPI_InitStruct->TransferDirection | SPI_InitStruct->Mode | SPI_InitStruct->DataWidth |
               SPI_InitStruct->ClockPolarity | SPI_InitStruct->ClockPhase |
               SPI_InitStruct->NSS | SPI_InitStruct->BaudRate |
               SPI_InitStruct->BitOrder | SPI_InitStruct->CRCCalculation);

    /*---------------------------- SPIx CTRL2 Configuration ------------------------
     * Configure SPIx CTRL2 with parameters:
     * - NSS management:     SSOE bit
     */
    MODIFY_REG(SPIx->CTRL2, SPI_CTRL2_SSOEN, (SPI_InitStruct->NSS >> 16U));

    /*---------------------------- SPIx CRCPOLY Configuration ----------------------
     * Configure SPIx CRCPR with parameters:
     * - CRCPoly:            CRCPOLY[15:0] bits
     */
    if (SPI_InitStruct->CRCCalculation == DDL_SPI_CRCCALCULATION_ENABLE)
    {
      ASSERT_PARAM(IS_DDL_SPI_CRC_POLYNOMIAL(SPI_InitStruct->CRCPoly));
      DDL_SPI_SetCRCPolynomial(SPIx, SPI_InitStruct->CRCPoly);
    }
    status = SUCCESS;
  }

  /* Activate the SPI mode (Reset I2SMOD bit in I2SCFGR register) */
  CLEAR_BIT(SPIx->I2SCFG, SPI_I2SCFG_MODESEL);
  return status;
}

/**
  * @brief  Set each @ref DDL_SPI_InitTypeDef field to default value.
  * @param  SPI_InitStruct pointer to a @ref DDL_SPI_InitTypeDef structure
  * whose fields will be set to default values.
  * @retval None
  */
void DDL_SPI_StructInit(DDL_SPI_InitTypeDef *SPI_InitStruct)
{
  /* Set SPI_InitStruct fields to default values */
  SPI_InitStruct->TransferDirection = DDL_SPI_FULL_DUPLEX;
  SPI_InitStruct->Mode              = DDL_SPI_MODE_SLAVE;
  SPI_InitStruct->DataWidth         = DDL_SPI_DATAWIDTH_8BIT;
  SPI_InitStruct->ClockPolarity     = DDL_SPI_POLARITY_LOW;
  SPI_InitStruct->ClockPhase        = DDL_SPI_PHASE_1EDGE;
  SPI_InitStruct->NSS               = DDL_SPI_NSS_HARD_INPUT;
  SPI_InitStruct->BaudRate          = DDL_SPI_BAUDRATEPRESCALER_DIV2;
  SPI_InitStruct->BitOrder          = DDL_SPI_MSB_FIRST;
  SPI_InitStruct->CRCCalculation    = DDL_SPI_CRCCALCULATION_DISABLE;
  SPI_InitStruct->CRCPoly           = 7U;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#if defined(APM32F402xx) || defined(APM32F403xx) || defined(APM32F405xx) || defined(APM32F407xx) || \
    defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
/** @addtogroup I2S_DDL
  * @{
  */

