betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_spi.c
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup I2S_DDL_Private_Constants I2S Private Constants
  * @{
  */
/* I2S registers Masks */
#define I2S_I2SCFG_CLEAR_MASK              (SPI_I2SCFG_CHLEN  | SPI_I2SCFG_DATALEN | \
                                            SPI_I2SCFG_CPOL   | SPI_I2SCFG_I2SSSEL | \
                                            SPI_I2SCFG_I2SMOD | SPI_I2SCFG_MODESEL )

#define I2S_I2SPSC_CLEAR_MASK               0x0002U
/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/** @addtogroup I2S_DDL_Private_Macros I2S Private Macros
  * @{
  */

#define IS_DDL_I2S_DATAFORMAT(__VALUE__)  (((__VALUE__) == DDL_I2S_DATAFORMAT_16B)             \
                                          || ((__VALUE__) == DDL_I2S_DATAFORMAT_16B_EXTENDED) \
                                          || ((__VALUE__) == DDL_I2S_DATAFORMAT_24B)          \
                                          || ((__VALUE__) == DDL_I2S_DATAFORMAT_32B))

#define IS_DDL_I2S_CPOL(__VALUE__)        (((__VALUE__) == DDL_I2S_POLARITY_LOW)  \
                                          || ((__VALUE__) == DDL_I2S_POLARITY_HIGH))

#define IS_DDL_I2S_STANDARD(__VALUE__)    (((__VALUE__) == DDL_I2S_STANDARD_PHILIPS)      \
                                          || ((__VALUE__) == DDL_I2S_STANDARD_MSB)       \
                                          || ((__VALUE__) == DDL_I2S_STANDARD_LSB)       \
                                          || ((__VALUE__) == DDL_I2S_STANDARD_PCM_SHORT) \
                                          || ((__VALUE__) == DDL_I2S_STANDARD_PCM_LONG))

#define IS_DDL_I2S_MODE(__VALUE__)        (((__VALUE__) == DDL_I2S_MODE_SLAVE_TX)     \
                                          || ((__VALUE__) == DDL_I2S_MODE_SLAVE_RX)  \
                                          || ((__VALUE__) == DDL_I2S_MODE_MASTER_TX) \
                                          || ((__VALUE__) == DDL_I2S_MODE_MASTER_RX))

#define IS_DDL_I2S_MCLK_OUTPUT(__VALUE__) (((__VALUE__) == DDL_I2S_MCLK_OUTPUT_ENABLE) \
                                          || ((__VALUE__) == DDL_I2S_MCLK_OUTPUT_DISABLE))

#define IS_DDL_I2S_AUDIO_FREQ(__VALUE__) ((((__VALUE__) >= DDL_I2S_AUDIOFREQ_8K)       \
                                          && ((__VALUE__) <= DDL_I2S_AUDIOFREQ_192K)) \
                                         || ((__VALUE__) == DDL_I2S_AUDIOFREQ_DEFAULT))

#define IS_DDL_I2S_PRESCALER_LINEAR(__VALUE__)  ((__VALUE__) >= 0x2U)

#define IS_DDL_I2S_PRESCALER_PARITY(__VALUE__) (((__VALUE__) == DDL_I2S_PRESCALER_PARITY_EVEN) \
                                               || ((__VALUE__) == DDL_I2S_PRESCALER_PARITY_ODD))
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup I2S_DDL_Exported_Functions
  * @{
  */

/** @addtogroup I2S_DDL_EF_Init
  * @{
  */

/**
  * @brief  De-initialize the SPI/I2S registers to their default reset values.
  * @param  SPIx SPI Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: SPI registers are de-initialized
  *          - ERROR: SPI registers are not de-initialized
  */
ErrorStatus DDL_I2S_DeInit(SPI_TypeDef *SPIx)
{
  return DDL_SPI_DeInit(SPIx);
}

/**
  * @brief  Initializes the SPI/I2S registers according to the specified parameters in I2S_InitStruct.
  * @note   As some bits in SPI configuration registers can only be written when the SPI is disabled (SPI_CTRL1_SPIEN bit =0),
  *         SPI peripheral should be in disabled state prior calling this function. Otherwise, ERROR result will be returned.
  * @param  SPIx SPI Instance
  * @param  I2S_InitStruct pointer to a @ref DDL_I2S_InitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: SPI registers are Initialized
  *          - ERROR: SPI registers are not Initialized
  */
ErrorStatus DDL_I2S_Init(SPI_TypeDef *SPIx, DDL_I2S_InitTypeDef *I2S_InitStruct)
{
  uint32_t i2sdiv = 2U;
  uint32_t i2sodd = 0U;
  uint32_t packetlength = 1U;
  uint32_t tmp;
#if !defined(RCM_PLLI2S_SUPPORT)
  DDL_RCM_ClocksTypeDef rcm_clocks;
#endif /* RCM_PLLI2S_SUPPORT */
  uint32_t sourceclock;
  ErrorStatus status = ERROR;

  /* Check the I2S parameters */
  ASSERT_PARAM(IS_I2S_ALL_INSTANCE(SPIx));
  ASSERT_PARAM(IS_DDL_I2S_MODE(I2S_InitStruct->Mode));
  ASSERT_PARAM(IS_DDL_I2S_STANDARD(I2S_InitStruct->Standard));
  ASSERT_PARAM(IS_DDL_I2S_DATAFORMAT(I2S_InitStruct->DataFormat));
  ASSERT_PARAM(IS_DDL_I2S_MCLK_OUTPUT(I2S_InitStruct->MCLKOutput));
  ASSERT_PARAM(IS_DDL_I2S_AUDIO_FREQ(I2S_InitStruct->AudioFreq));
  ASSERT_PARAM(IS_DDL_I2S_CPOL(I2S_InitStruct->ClockPolarity));

  if (DDL_I2S_IsEnabled(SPIx) == 0x00000000U)
  {
    /*---------------------------- SPIx I2SCFG Configuration --------------------
     * Configure SPIx I2SCFG with parameters:
     * - Mode:          SPI_I2SCFG_I2SMOD[1:0] bit
     * - Standard:      SPI_I2SCFG_I2SSSEL[1:0] and SPI_I2SCFG_PFSSEL bits
     * - DataFormat:    SPI_I2SCFG_CHLEN and SPI_I2SCFG_DATALEN bits
     * - ClockPolarity: SPI_I2SCFG_CPOL bit
     */

    /* Write to SPIx I2SCFG */
    MODIFY_REG(SPIx->I2SCFG,
               I2S_I2SCFG_CLEAR_MASK,
               I2S_InitStruct->Mode | I2S_InitStruct->Standard |
               I2S_InitStruct->DataFormat | I2S_InitStruct->ClockPolarity |
               SPI_I2SCFG_MODESEL);

    /*---------------------------- SPIx I2SPSC Configuration ----------------------
     * Configure SPIx I2SPSC with parameters:
     * - MCLKOutput:    SPI_I2SPSC_MCOEN bit
     * - AudioFreq:     SPI_I2SPSC_I2SPSC[7:0] and SPI_I2SPSC_ODDPS bits
     */

    /* If the requested audio frequency is not the default, compute the prescaler (i2sodd, i2sdiv)
     * else, default values are used:  i2sodd = 0U, i2sdiv = 2U.
     */
    if (I2S_InitStruct->AudioFreq != DDL_I2S_AUDIOFREQ_DEFAULT)
    {
      /* Check the frame length (For the Prescaler computing)
       * Default value: DDL_I2S_DATAFORMAT_16B (packetlength = 1U).
       */
      if (I2S_InitStruct->DataFormat != DDL_I2S_DATAFORMAT_16B)
      {
        /* Packet length is 32 bits */
        packetlength = 2U;
      }

#if defined(RCM_PLLI2S_SUPPORT)
      /* If an external I2S clock has to be used, the specific define should be set
      in the project configuration or in the apm32f4xx_ddl_rcm.h file */
      /* Get the I2S source clock value */
      sourceclock = DDL_RCM_GetI2SClockFreq(DDL_RCM_I2S1_CLKSOURCE);
#else
      /* I2S Clock source is System clock: Get System Clock frequency */
      DDL_RCM_GetSystemClocksFreq(&rcm_clocks);
      sourceclock = rcm_clocks.SYSCLK_Frequency;
#endif /* RCM_PLLI2S_SUPPORT */

      /* Compute the Real divider depending on the MCLK output state with a floating point */
      if (I2S_InitStruct->MCLKOutput == DDL_I2S_MCLK_OUTPUT_ENABLE)
      {
        /* MCLK output is enabled */
        tmp = (((((sourceclock / 256U) * 10U) / I2S_InitStruct->AudioFreq)) + 5U);
      }
      else
      {
        /* MCLK output is disabled */
        tmp = (((((sourceclock / (32U * packetlength)) * 10U) / I2S_InitStruct->AudioFreq)) + 5U);
      }

      /* Remove the floating point */
      tmp = tmp / 10U;

      /* Check the parity of the divider */
      i2sodd = (tmp & (uint16_t)0x0001U);

      /* Compute the i2sdiv prescaler */
      i2sdiv = ((tmp - i2sodd) / 2U);

