betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_spi.c
      /* Get the Mask for the Odd bit (SPI_I2SPSC[8]) register */
      i2sodd = (i2sodd << 8U);
    }

    /* Test if the divider is 1 or 0 or greater than 0xFF */
    if ((i2sdiv < 2U) || (i2sdiv > 0xFFU))
    {
      /* Set the default values */
      i2sdiv = 2U;
      i2sodd = 0U;
    }

    /* Write to SPIx I2SPSC register the computed value */
    WRITE_REG(SPIx->I2SPSC, i2sdiv | i2sodd | I2S_InitStruct->MCLKOutput);

    status = SUCCESS;
  }
  return status;
}

/**
  * @brief  Set each @ref DDL_I2S_InitTypeDef field to default value.
  * @param  I2S_InitStruct pointer to a @ref DDL_I2S_InitTypeDef structure
  *         whose fields will be set to default values.
  * @retval None
  */
void DDL_I2S_StructInit(DDL_I2S_InitTypeDef *I2S_InitStruct)
{
  /*--------------- Reset I2S init structure parameters values -----------------*/
  I2S_InitStruct->Mode              = DDL_I2S_MODE_SLAVE_TX;
  I2S_InitStruct->Standard          = DDL_I2S_STANDARD_PHILIPS;
  I2S_InitStruct->DataFormat        = DDL_I2S_DATAFORMAT_16B;
  I2S_InitStruct->MCLKOutput        = DDL_I2S_MCLK_OUTPUT_DISABLE;
  I2S_InitStruct->AudioFreq         = DDL_I2S_AUDIOFREQ_DEFAULT;
  I2S_InitStruct->ClockPolarity     = DDL_I2S_POLARITY_LOW;
}

/**
  * @brief  Set linear and parity prescaler.
  * @note   To calculate value of PrescalerLinear(I2SDIV[7:0] bits) and PrescalerParity(ODD bit)\n
  *         Check Audio frequency table and formulas inside Reference Manual (SPI/I2S).
  * @param  SPIx SPI Instance
  * @param  PrescalerLinear value Min_Data=0x02 and Max_Data=0xFF.
  * @param  PrescalerParity This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_ODD
  * @retval None
  */
void DDL_I2S_ConfigPrescaler(SPI_TypeDef *SPIx, uint32_t PrescalerLinear, uint32_t PrescalerParity)
{
  /* Check the I2S parameters */
  ASSERT_PARAM(IS_I2S_ALL_INSTANCE(SPIx));
  ASSERT_PARAM(IS_DDL_I2S_PRESCALER_LINEAR(PrescalerLinear));
  ASSERT_PARAM(IS_DDL_I2S_PRESCALER_PARITY(PrescalerParity));

  /* Write to SPIx I2SPSC */
  MODIFY_REG(SPIx->I2SPSC, SPI_I2SPSC_I2SPSC | SPI_I2SPSC_ODDPS, PrescalerLinear | (PrescalerParity << 8U));
}

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
/**
  * @brief  Configures the full duplex mode for the I2Sx peripheral using its extension
  *         I2Sxext according to the specified parameters in the I2S_InitStruct.
  * @note   The structure pointed by I2S_InitStruct parameter should be the same
  *         used for the master I2S peripheral. In this case, if the master is
  *         configured as transmitter, the slave will be receiver and vice versa.
  *         Or you can force a different mode by modifying the field I2S_Mode to the
  *         value I2S_SlaveRx or I2S_SlaveTx independently of the master configuration.
  * @param  I2Sxext SPI Instance
  * @param  I2S_InitStruct pointer to a @ref DDL_I2S_InitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: I2Sxext registers are Initialized
  *          - ERROR: I2Sxext registers are not Initialized
  */
ErrorStatus  DDL_I2S_InitFullDuplex(SPI_TypeDef *I2Sxext, DDL_I2S_InitTypeDef *I2S_InitStruct)
{
  uint32_t mode = 0U;
  ErrorStatus status = ERROR;

  /* Check the I2S parameters */
#if defined(I2S2ext) || defined(I2S3ext)
  ASSERT_PARAM(IS_I2S_EXT_ALL_INSTANCE(I2Sxext));
#endif /* I2S2ext || I2S3ext */
  ASSERT_PARAM(IS_DDL_I2S_MODE(I2S_InitStruct->Mode));
  ASSERT_PARAM(IS_DDL_I2S_STANDARD(I2S_InitStruct->Standard));
  ASSERT_PARAM(IS_DDL_I2S_DATAFORMAT(I2S_InitStruct->DataFormat));
  ASSERT_PARAM(IS_DDL_I2S_CPOL(I2S_InitStruct->ClockPolarity));

  if (DDL_I2S_IsEnabled(I2Sxext) == 0x00000000U)
  {
    /*---------------------------- SPIx I2SCFG Configuration --------------------
     * Configure SPIx I2SCFG with parameters:
     * - Mode:          SPI_I2SCFG_I2SMOD[1:0] bit
     * - Standard:      SPI_I2SCFG_I2SSSEL[1:0] and SPI_I2SCFG_PFSSEL bits
     * - DataFormat:    SPI_I2SCFG_CHLEN and SPI_I2SCFG_DATALEN bits
     * - ClockPolarity: SPI_I2SCFG_CPOL bit
     */

    /* Reset I2SPSC registers */
    WRITE_REG(I2Sxext->I2SPSC, I2S_I2SPSC_CLEAR_MASK);

    /* Get the mode to be configured for the extended I2S */
    if ((I2S_InitStruct->Mode == DDL_I2S_MODE_MASTER_TX) || (I2S_InitStruct->Mode == DDL_I2S_MODE_SLAVE_TX))
    {
      mode = DDL_I2S_MODE_SLAVE_RX;
    }
    else
    {
      if ((I2S_InitStruct->Mode == DDL_I2S_MODE_MASTER_RX) || (I2S_InitStruct->Mode == DDL_I2S_MODE_SLAVE_RX))
      {
        mode = DDL_I2S_MODE_SLAVE_TX;
      }
    }

    /* Write to SPIx I2SCFG */
    MODIFY_REG(I2Sxext->I2SCFG,
               I2S_I2SCFG_CLEAR_MASK,
               I2S_InitStruct->Standard |
               I2S_InitStruct->DataFormat | I2S_InitStruct->ClockPolarity |
               SPI_I2SCFG_MODESEL | mode);

    status = SUCCESS;
  }
  return status;
}
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* APM32F402xx || APM32F403xx || APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

#endif /* defined (SPI1) || defined (SPI2) || defined (SPI3) || defined (SPI4) || defined (SPI5) || defined(SPI6) */

/**
  * @}
  */

#endif /* USE_FULL_DDL_DRIVER */

